---
title: TableCellCombinedParameterData
classe: Autodesk.Revit.DB.TableCellCombinedParameterData
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# TableCellCombinedParameterData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId CategoryId { get; set; }` | `tableCellCombinedParameterData.CategoryId` | ElementId |
| `Boolean IsValidObject { get; }` | `tableCellCombinedParameterData.IsValidObject` | Boolean |
| `ElementId ParamId { get; set; }` | `tableCellCombinedParameterData.ParamId` | ElementId |
| `String Prefix { get; set; }` | `tableCellCombinedParameterData.Prefix` | String |
| `String SampleValue { get; set; }` | `tableCellCombinedParameterData.SampleValue` | String |
| `String Separator { get; set; }` | `tableCellCombinedParameterData.Separator` | String |
| `String Suffix { get; set; }` | `tableCellCombinedParameterData.Suffix` | String |
| `TableCellCombinedParameterData Create()` | `TableCellCombinedParameterData.Create()` | TableCellCombinedParameterData |
| `Void Dispose()` | `tableCellCombinedParameterData.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```